0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    ami1
    {
        type            cyclicAMI;
        value           $internalField;
    }
    
    wall2in
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    wall2out
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
   
    wall1in  // hub
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
    wall1out  // shroud
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
                
    ami2
    {
        type            cyclicAMI;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }


}


// ************************************************************************* //
